
#include <iostream>
#include <clocale>
using namespace std;

int main() {
    setlocale(LC_ALL, ".UTF8");
    int n, m;

    cout << "Введите n, m: ";
    cin >> n >> m;

    cout << endl << "Первое выражение: n---m" << endl;
    cout << "Результат: " << n-- - m << endl; /* сначала выполняется вычитание n - m с использованием старого значения n, 
    так как декремент имеет постфиксную форму, после чего n уменьшается на 1 */
    cout << "n = " << n << ", m = " << m << endl; // n уменьшается на 1, m не изменяется

    cout << endl << "Второе выражение: m-- < n" << endl;
    cout << "Результат: " << (m-- < n) << endl; /* сначала выполняется сравнение старого значения m с n, 
    так как декремент имеет постфиксную форму, после чего m уменьшается на 1 */
    cout << "n = " << n << ", m = " << m << endl; // n не изменяется, m уменьшается на 1

    cout << endl << "Третье выражение: n++ > m" << endl;
    cout << "Результат: " << (n++ > m) << endl; /* сначала выполняется сравнение старого значения n с m, 
    так как инкремент имеет постфиксную форму, после чего n увеличивается на 1 */
    cout << "n = " << n << ", m = " << m << endl; // n увеличивается на 1, m не изменяется

    return 0;
}
